      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.16.0 - 06.11.2019 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D BASICS1_VERSION...
     D                 C                   '1.16.0'
     D BASICS1_DATE...
     D                 C                   '06.11.2019'
