      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.16.1 - 17.09.2022 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D BASICS1_VERSION...
     D                 C                   '1.16.1'
     D BASICS1_DATE...
     D                 C                   '17.09.2022'
