      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.15.2 - 18.04.2017 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D BASICS1_VERSION...
     D                 C                   '1.15.2'
     D BASICS1_DATE...
     D                 C                   '18.04.2017'
