**FREE
ctl-opt DEBUG OPTION(*SRCSTMT : *NODEBUGIO);
/IF NOT DEFINED(NO_DECEDIT)
ctl-opt DECEDIT('0,');
/ENDIF
ctl-opt DATEDIT(*DMY.);
ctl-opt DATFMT(*ISO ) TIMFMT(*ISO );
ctl-opt EXPROPTS(*RESDECPOS);
ctl-opt EXTBININT(*YES);
ctl-opt CCSID(*CHAR: *JOBRUN);
